OdIfcRxDisplayAsAttribute.setShowIndex(System.Boolean)
\details
Sets the new value of the flag that determines whether the attribute index is displayed.
If the flag value is equal to true, the index is displayed; otherwise (the flag value is equal to false), the index is not displayed.
\param val [in] A new flag value to be set.

OdIfcRxDisplayAsAttribute.setShowObjectType(System.Boolean)
\details
Sets the new value of the flag that determines whether the attribute type is displayed.
If the flag value is equal to true, the type is displayed; otherwise (the flag value is equal to false), the type is not displayed.
\param val [in] A new flag value to be set.

OdIfcRxDisplayAsAttribute.getDisplayValue(OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Dereferences the IFC attribute value and retrieves the property which name is stored in the attribute.
\param value                [in] A value to dereference and retrieve the property of.
\param useDynamicProperties [in] A flag that determines whether the getting of the displayed value should be optimized (is equal to true) or not (is equal to false).
\returns
The name of the dereferenced object's property to use instead of the object identifier.
If the passed value type is not a reference or the referenced object has no such property, the method returns an empty string.
\remarks
The useDynamicProperties flag can be set to false only if all properties of the database objects are statically dependent on the object type.

OdIfcRxDisplayAsAttribute.createObject(System.Boolean,System.Boolean)
\details
Createa a new IFC attribute instance with specified parameters.
\param bShowIndex       [in] A flag that determines whether the index of the created attributes should be shown.
\param bShowObjectType  [in] A flag that determines whether the type of the created attributes should be shown.
\returns A smart pointer to the created attribut object.

OdIfcRxDisplayAsAttribute
\details
The class implements an IFC attribute that can be used by the user interface to represent property values in a human-readable form (instead of displaying just a handle).